app/Views/progetti/show.php

                            <?php
                            // Carica i fornitori dal database utilizzando il modello
                            $anagraficheModel = new \App\Models\AnagraficaModel();
                            $fornitori = $anagraficheModel->where('fornitore', 1)->where('attivo', 1)->findAll();
---
SELECT *
FROM `anagrafiche`
WHERE `fornitore` = 1
AND `attivo` = 1
AND `anagrafiche`.`deleted_at` IS NULL