app/Models/ProgettoModel.php

    public function getProgettoWithRelations(int $id): ?array
    {
        $progetto = $this->find($id);

        if (empty($progetto)) {
            return null;
        }

        // Carica anagrafica
        if (!empty($progetto['id_anagrafica'])) {
            $anagraficaModel = new AnagraficaModel();
            $progetto['anagrafica'] = $anagraficaModel->find($progetto['id_anagrafica']);
        }

        // Carica creatore
        if (!empty($progetto['id_creato_da'])) {
            $utentiModel = new UtentiModel();
            $progetto['creatore'] = $utentiModel->find($progetto['id_creato_da']);
            unset($progetto['creatore']['password']);
        }

        // Carica responsabile
        if (!empty($progetto['id_responsabile'])) {
            $utentiModel = new UtentiModel();
            $progetto['responsabile'] = $utentiModel->find($progetto['id_responsabile']);
---
SELECT *
FROM `utenti`
WHERE `utenti`.`deleted_at` IS NULL
AND `utenti`.`id` = 1